{'StartDate': 'Start Date', 'EndDate': 'End Date', 'Status': 'Response Type', 'IPAddress': 'IP Address', 'Progress': 'Progress', 'Duration (in seconds)': 'Duration (in seconds)', 'Finished': 'Finished', 'RecordedDate': 'Recorded Date', 'ResponseId': 'Response ID', 'RecipientLastName': 'Recipient Last Name', 'RecipientFirstName': 'Recipient First Name', 'RecipientEmail': 'Recipient Email', 'ExternalReference': 'External Data Reference', 'LocationLatitude': 'Location Latitude', 'LocationLongitude': 'Location Longitude', 'DistributionChannel': 'Distribution Channel', 'UserLanguage': 'User Language', 'Q1': 'Productivity is more important to me than quality', 'Q83': 'My motivation has more influence on my productivity, than my skill', 'Q84': 'I regularly reach a high level of productivity', 'Q85': 'I am a relatively productive programmer', 'Q87': 'I am skilled in software development', 'Q88': 'My code is of high quality', 'Q89': 'I am satisfied with my performance in software development', 'Q90': 'I want my code to be beautiful', 'Q91': 'I enjoy software development very much', 'Q92': 'It is important for me to program well', 'Q93': 'I write tests for my code', 'Q94': 'I write detailed commit messages', 'Q95': 'I contribute to open source in order to have an online portfolio', 'Q96': 'I try to write high quality code because others will see it', 'Q97': 'I enjoy trying to solve complex problems', 'Q98': 'I contribute to open source in order to become a better programmer', 'Q99': 'I improved as a programmer since a year ago', 'Q71': 'I contribute to open source due to ideology', 'Q29': 'Please choose one specific GitHub repository that you work on.Answer the following questions with respect to this repository.If you work on more than one suitable repository and have the time, we will be thankful if you will answer the survey on the other repository too after you finish answering on the current one.\r\nWhat is the link of the GitHub repository that you answer on?:', 'Q30': 'How many hours a week do you work on the repository (average)?', 'Q31': 'I’m being paid for my work in this repository', 'Q86': 'I regularly have a high level of motivation to contribute to the repository', 'Q34': 'I have complete autonomy in contributing to the repository', 'Q102': 'I have significant influence on the repository', 'Q101': 'I feel responsible to the repository success', 'Q67': 'I’m interested in the repository for my own needs', 'Q68': 'We have many heated arguments in the community. If you are the only developer in the project, please skip.', 'Q69': 'I wish that certain developers in the repository will leave. If you are the only developer in the project, please skip.', 'Q70': 'My work on the repository is creative', 'Q71.1': 'Working on this repository is challenging', 'Q72': 'I derive satisfaction from working on this repository', 'Q73': 'The repository is important', 'Q74': 'When I look at what we accomplish, I feel a sense of pride', 'Q75': 'Belonging to the  community is motivating my work on the repository. If you are the only developer in the project, please skip.', 'Q76': 'The community is very professional. If you are the only developer in the project, please skip.', 'Q77': 'I get recognition due to my contribution to the repository', 'Q78': 'I am a core member of the repository', 'Q79': 'I learn from my contributions', 'Q81': 'The quality of the code in this repository is better than others', 'Q82': 'Code quality in the repository improved since a year ago', 'Q83.1': 'The repository’s community of developers is more motivated than that of other repositories. If you are the only developer in the project, please skip.', 'Q84.1': 'My personal motivation in this repository has increased since a year ago', 'Q95.1': 'In the past year, members of my GitHub community put me down or were condescending to me. If you are the only developer in the project, please skip.', 'Q96.1': 'In the past year, members of my GitHub community made demeaning or derogatory remarks about me. If you are the only developer in the project, please skip.', 'Q97.1': 'In the past year, members of my GitHub community asked questions that show their understanding of my contributions. If you are the only developer in the project, please skip.', 'Q98.1': 'In the past year, members of my GitHub community expressed interest in my contributions. If you are the only developer in the project, please skip.', 'Q72.1': 'The following questions are from Job Satisfaction Scale questionnaire.We present the questionnaire as is in order to compare to previous results. \r\nIn case that you find some questions irrelevant, please skip them.\r\nThe questions indicate level of satisfaction with the following:\r\nFreedom to choose your own method of working', 'Q86.1': 'Amount of variety in your work', 'Q87.1': 'Physical working conditions', 'Q88.1': 'Opportunities to use your abilities', 'Q89.1': 'Your colleagues and fellow workers', 'Q90.1': 'Recognition you get for good work', 'Q91.1': 'Your hours of work', 'Q92.1': 'Your remuneration (payment)', 'Q93.1': 'Amount of responsibility you are given', 'Q94.1': 'Taking everything into consideration, how do you feel about your work?', 'Q60': 'Country', 'Q61_1': 'Age', 'Q62': 'Gender', 'Q63': 'I work as a professional programmer', 'Q64': 'Years of work experience (not including studies)', 'Q65_1': 'Years of contribution to GitHub - Click to write Choice 1', 'Q66': 'Academic background (degree)', 'Q67.1': 'Academic background (degree and graduation year)', 'Q68.1': 'GitHub profile page\r\nWe would like to have a link to your profile in order to match your answers and GitHub activity (e.g., number of commits last month, years in the repository).We are aware that the profile is a personal identifier and we will keep it private and use it for research purposes only.The results of analysis of the match data will be reported in aggregated form only.\r\nOf course, in case that you are not interested, you can leave the field empty.', 'Q71.2': "Do you have any comments on the questionnaire or research? Are you motivated due to a cause that we didn't consider? Do you have a method that increases your code quality?", 'Q68.2': 'Thank you for answering our survey.If you would like to be informed in the results of the research or to participate in the gift card lottery, please enter your email and we will send it to you once completed. The email will not be used for profile identification.', 'survey': 'GitHub_Developers_survey_April_24_2021.csv', 'sampling_method': 'random_approach'}